---
kind: method
id: M:Autodesk.Revit.DB.Transform2D.#ctor(Autodesk.Revit.DB.Transform2D)
source: html/ad1bd942-9cbc-c269-e3d6-ee2ad8bedbaf.htm
---
# Autodesk.Revit.DB.Transform2D.#ctor Method

The copy constructor.

## Syntax (C#)
```csharp
public Transform2D(
	Transform2D other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Transform2D`) - The transformation to use as input.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null